// Напишите программу, которая на вход принимает целое
// число и выдает его квадрат (число усноженное на само себя)

Console.WriteLine ("Введите целое число: ");
int number = Convert.ToInt32(Console.ReadLine()); // команда, которая может принимать целые числа

int result = number * number;

Console.WriteLine($"Квадрат введенного числа = {result}"); // $ воспринимается как переменная 

